SA4/system/graphFunctionObject
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

residualGraph1
{
    // Mandatory entries
    type            graphFunctionObject;
    libs            (utilityFunctionObjects);

functions
{
    Ux
    {
        object      solverInfo1;
        entry       Ux_final;
    }
    Uy
    {
        object      solverInfo1;
        entry       Uy_final;
    }
    Uz
    {
        object      solverInfo1;
        entry       Uz_final;
    }
    p
    {
        object      solverInfo1;
        entry       p_final;
    }

    nuTilda
    {
        object      solverInfo1;
        entry       nuTilda_final;
    }

}


    // Optional entries
    logScaleX       no;
    logScaleY       yes;
    xlabel          "Iteration";
    ylabel          "log10(Initial residual)";
    // xMin            <scalar>;
    // xMax            <scalar>;
    // yMin            <scalar>;
    // yMax            <scalar>;
    // width           <label>;
    // height          <label>;
    // strokeWidth     <label>;
    // drawGrid        <bool>;

    // Inherited entries
    writePrecision   6;
    writeToFile      true;
    useUserTime      true;

    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         2000;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   -1;
}


forceCoeffsGraph1
{
    type            graphFunctionObject;
    libs            (utilityFunctionObjects);
    writeControl    writeTime;

    logScaleX       no;
    logScaleY       no;

    xlabel          "Iteration";
    ylabel          "Coefficient";

    yMin            -0.1;
    yMax            1.5;

    functions
    {
        Cd
        {
            object      forceCoeffs1;
            entry       Cd;
        }
        // CdMean
        // {
        //     object      valueAverage1;
        //     entry       CdMean;
        // }
/*
        Cd(f)
        {
            object      forceCoeffs1;
            entry       Cd(f);
        }
        Cd(r)
        {
            object      forceCoeffs1;
            entry       Cd(r);
        }
*/

        Cl
        {
            object      forceCoeffs1;
            entry       Cl;
            //colour      (0, 0, 0);
        }
        // ClMean
        // {
        //     object      valueAverage1;
        //     entry       ClMean;
        // }
/*
        Cl(f)
        {
            object      forceCoeffs1;
            entry       Cl(f);
            //colour      (0, 0, 0);
            title       Cl(f);
        }
        Cl(r)
        {
            object      forceCoeffs1;
            entry       Cl(r);
            //colour      (0, 0, 0);
            title       Cl(r);
        }
*/

        nuTilda
        {
            object      solverInfo1;
            entry       nuTilda_initial;
        }
    }
}


// ************************************************************************* //
